# Step 1. Import libraries and load data

In [13]:
# import libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# load the data
jeju_reg_17_df = pd.read_csv('../data/jeju_card_region_2017_english.csv')
jeju_reg_18_df = pd.read_csv('../data/jeju_card_region_2018_english.csv')
jeju_pop_df = pd.read_csv('../data/jeju_population_english.csv')

# Step 2. Explore data

In [14]:
print(jeju_reg_17_df.shape) 
print(jeju_reg_18_df.shape)
print(jeju_pop_df.shape)

(26968, 7)
(27183, 7)
(527026, 6)

In [15]:
jeju_reg_17_df.head()

,Year_Month,City/County_Life_Name,Eup/myeon/dong_name,Industry_name,gender,Number_of_users,Usage_amount
0,2017-01-01,Seogwipo City,Namwon-eup,Health supplement retailing,male,11,137500
1,2017-01-01,Seogwipo City,Cheonji-dong,Health supplement retailing,female,61,12334400
2,2017-01-01,Seogwipo City,Daejeong-eup,General retail business focusing on other food...,male,555,17301300
3,2017-01-01,Seogwipo City,Daejeong-eup,Other bar business,male,324,71843080
4,2017-01-01,Seogwipo City,Daejeong-eup,Other foreign restaurant business,male,40,971000

In [16]:
jeju_reg_18_df.head()

,Year_Month,City/County_Life_Name,Eup/myeon/dong_name,Industry_name,gender,Number_of_users,Usage_amount
0,2018-01-01,Jeju City,Aradong,Vehicle gas station operation business,male,3954,205339045
1,2018-01-01,Jeju City,Samdo 1-dong,Vehicle gas station operation business,male,490,29469792
2,2018-01-01,Jeju City,Samdo 2-dong,meat retail,female,89,2386740
3,2018-01-01,Jeju City,Samdo 1-dong,Sports and recreational equipment rental business,male,106,12517300
4,2018-01-01,Jeju City,Samdo 1-dong,seafood retail,male,37,2621000

In [12]:
jeju_pop_df.head()

,year_month_day,City/County_Life_Name,Eup/myeon/dong_name,gender,age_range,Visiting_population
0,20170101,Jeju City,Hallim-eup,other,40s,19424
1,20170101,Jeju City,Aewol-eup,female,20s,27747
2,20170101,Jeju City,Gujwa-eup,other,70s,3459
3,20170101,Jeju City,Jocheon-eup,other,40s,36695
4,20170101,Jeju City,Hangyeong-myeon,other,70s,1174

In [17]:
jeju_reg_17_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26968 entries, 0 to 26967
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Year_Month             26968 non-null  object
 1   City/County_Life_Name  26968 non-null  object
 2   Eup/myeon/dong_name    26968 non-null  object
 3   Industry_name          26968 non-null  object
 4   gender                 26968 non-null  object
 5   Number_of_users        26968 non-null  int64
 6   Usage_amount           26968 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

In [18]:
jeju_reg_18_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27183 entries, 0 to 27182
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Year_Month             27183 non-null  object
 1   City/County_Life_Name  27183 non-null  object
 2   Eup/myeon/dong_name    27183 non-null  object
 3   Industry_name          27183 non-null  object
 4   gender                 27183 non-null  object
 5   Number_of_users        27183 non-null  int64
 6   Usage_amount           27183 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.5+ MB

In [19]:
jeju_pop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527026 entries, 0 to 527025
Data columns (total 6 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   year_month_day         527026 non-null  int64
 1   City/County_Life_Name  527026 non-null  object
 2   Eup/myeon/dong_name    527026 non-null  object
 3   gender                 527026 non-null  object
 4   age_range              527026 non-null  object
 5   Visiting_population    527026 non-null  int64
dtypes: int64(2), object(4)
memory usage: 24.1+ MB

In [23]:
pd.options.display.float_format = '{:.3f}'.format

jeju_reg_17_df.describe(include='all')

,Year_Month,City/County_Life_Name,Eup/myeon/dong_name,Industry_name,gender,Number_of_users,Usage_amount
count,26968,26968,26968,26968,26968,26968.000,26968.000
unique,12,2,43,41,2,NaN,NaN
top,2017-11-01,Jeju City,Nohyeong-dong,Korean restaurant business,male,NaN,NaN
freq,2265,16076,795,1032,13518,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,1703.495,63231393.341
std,NaN,NaN,NaN,NaN,NaN,4313.161,198798394.063
min,NaN,NaN,NaN,NaN,NaN,1.000,10.000
25%,NaN,NaN,NaN,NaN,NaN,43.000,2635000.000
50%,NaN,NaN,NaN,NaN,NaN,281.000,12125170.000
75%,NaN,NaN,NaN,NaN,NaN,1333.250,49059281.000
max,NaN,NaN,NaN,NaN,NaN,62761.000,5092989749.000

In [24]:
jeju_reg_18_df.describe(include='all')

,Year_Month,City/County_Life_Name,Eup/myeon/dong_name,Industry_name,gender,Number_of_users,Usage_amount
count,27183,27183,27183,27183,27183,27183.000,27183.000
unique,12,2,43,41,2,NaN,NaN
top,2018-09-01,Jeju City,Nohyeong-dong,Korean restaurant business,male,NaN,NaN
freq,2285,16228,812,1032,13645,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,1726.604,62044256.570
std,NaN,NaN,NaN,NaN,NaN,4399.634,190042848.439
min,NaN,NaN,NaN,NaN,NaN,1.000,10.000
25%,NaN,NaN,NaN,NaN,NaN,45.000,2706600.000
50%,NaN,NaN,NaN,NaN,NaN,288.000,12311900.000
75%,NaN,NaN,NaN,NaN,NaN,1339.000,49426169.000
max,NaN,NaN,NaN,NaN,NaN,63621.000,4836250309.000

In [25]:
jeju_pop_df.describe(include='all')

,year_month_day,City/County_Life_Name,Eup/myeon/dong_name,gender,age_range,Visiting_population
count,527026.000,527026,527026,527026,527026,527026.000
unique,NaN,2,43,2,9,NaN
top,NaN,Jeju City,Samdo 1-dong,female,60s,NaN
freq,NaN,318669,12264,263533,58592,NaN
mean,20175307.456,NaN,NaN,NaN,NaN,9931.281
std,4999.286,NaN,NaN,NaN,NaN,9974.524
min,20170101.000,NaN,NaN,NaN,NaN,0.000
25%,20170620.000,NaN,NaN,NaN,NaN,3292.000
50%,20171207.000,NaN,NaN,NaN,NaN,6811.000
75%,20180526.000,NaN,NaN,NaN,NaN,12783.000
max,20181231.000,NaN,NaN,NaN,NaN,98444.000

# Step 3. Data Preprocessing and Comparison: 2017 vs. 2018

In [30]:
def print_unique_values(df):
    object_columns = df.columns[df.dtypes == 'object']
    for col in object_columns:
        print(f"Number of unique values in the '{col}' column: {df[col].nunique()}")
        print(sorted(df[col].unique()), '\n')

print_unique_values(jeju_reg_17_df)

Number of unique values in the 'Year_Month' column: 12
['2017-01-01', '2017-02-01', '2017-03-01', '2017-04-01', '2017-05-01', '2017-06-01', '2017-07-01', '2017-08-01', '2017-09-01', '2017-10-01', '2017-11-01', '2017-12-01']

Number of unique values in the 'City/County_Life_Name' column: 2
['Jeju City', 'Seogwipo City']

Number of unique values in the 'Eup/myeon/dong_name' column: 43
['Aewol-eup', 'Andeok-myeon', 'Aradong', 'Bonggae-dong', 'Cheonji-dong', 'Daecheon-dong', 'Daejeong-eup', 'Daeryun-dong', 'Dodu-dong', 'Donghong-dong', 'Geonip-dong', 'Gujwa-eup', 'Hallim-eup', 'Hangyeong-myeon', 'Hwabuk-dong', 'Hyodon-dong', 'Ido 1-dong', 'Ido 2-dong', 'Ildo 1-dong', 'Ildo 2-dong', 'Jeongbang-dong', 'Jocheon-eup', 'Jungang-dong', 'Jungmun-dong', 'Lee Ho-dong', "Let's do it", 'Namwon-eup', 'Nohyeong-dong', 'Oedo-dong', 'Ora-dong', 'Pyoseon-myeon', 'Samdo 1-dong', 'Samdo 2-dong', 'Samyang-dong', 'Seohong-dong', 'Seongsan-eup', 'Songsan-dong', 'Udo-myeon', 'Yeongcheon-dong', 'Yerae-dong', 'Yongdam 1-dong', 'Yongdam 2-dong', 'peristalsis']

Number of unique values in the 'Industry_name' column: 41
['Bath business', 'Bread and confectionery retail', 'Chinese restaurant industry', 'Cosmetics and fragrance retail', 'Exhibition and event agency business', 'Fruit and Vegetable Retail', 'Gas refilling business for vehicles', 'General entertainment bar business', 'General retail business focusing on other food products', 'Golf course operation business', 'Health supplement retailing', 'Inner port passenger transportation industry', 'Japanese restaurant industry', 'Korean restaurant business', 'Non-alcoholic beverage store', 'Other bar business', 'Other foreign restaurant business', 'Other gambling and betting businesses', 'Other general retail stores', 'Other large general retail stores', 'Other sports facility operation business', 'Other unclassified entertainment-related service industries', 'Other water entertainment service industry', 'Pizza, hamburger, sandwich and similar restaurant business', 'Recreational condo operation business', 'Sports and recreational equipment rental business', 'Tourism Folk Crafts and Gifts Retail', 'Vehicle gas station operation business', 'Western-style restaurant business', 'bus transportation', 'car rental business', 'chain convenience store', 'duty free shop', 'hotel industry', 'inn business', 'massage business', 'meat retail', 'scheduled air transport', 'seafood retail', 'supermarket', 'travel business']

Number of unique values in the 'gender' column: 2
['female', 'male']

In [31]:
print_unique_values(jeju_reg_18_df)

Number of unique values in the 'Year_Month' column: 12
['2018-01-01', '2018-02-01', '2018-03-01', '2018-04-01', '2018-05-01', '2018-06-01', '2018-07-01', '2018-08-01', '2018-09-01', '2018-10-01', '2018-11-01', '2018-12-01']

Number of unique values in the 'City/County_Life_Name' column: 2
['Jeju City', 'Seogwipo City']

Number of unique values in the 'Eup/myeon/dong_name' column: 43
['Aewol-eup', 'Andeok-myeon', 'Aradong', 'Bonggae-dong', 'Cheonji-dong', 'Daecheon-dong', 'Daejeong-eup', 'Daeryun-dong', 'Dodu-dong', 'Donghong-dong', 'Geonip-dong', 'Gujwa-eup', 'Hallim-eup', 'Hangyeong-myeon', 'Hwabuk-dong', 'Hyodon-dong', 'Ido 1-dong', 'Ido 2-dong', 'Ildo 1-dong', 'Ildo 2-dong', 'Jeongbang-dong', 'Jocheon-eup', 'Jungang-dong', 'Jungmun-dong', 'Lee Ho-dong', "Let's do it", 'Namwon-eup', 'Nohyeong-dong', 'Oedo-dong', 'Ora-dong', 'Pyoseon-myeon', 'Samdo 1-dong', 'Samdo 2-dong', 'Samyang-dong', 'Seohong-dong', 'Seongsan-eup', 'Songsan-dong', 'Udo-myeon', 'Yeongcheon-dong', 'Yerae-dong', 'Yongdam 1-dong', 'Yongdam 2-dong', 'peristalsis']

Number of unique values in the 'Industry_name' column: 41
['Bath business', 'Bread and confectionery retail', 'Chinese restaurant industry', 'Cosmetics and fragrance retail', 'Exhibition and event agency business', 'Fruit and Vegetable Retail', 'Gas refilling business for vehicles', 'General entertainment bar business', 'General retail business focusing on other food products', 'Golf course operation business', 'Health supplement retailing', 'Inner port passenger transportation industry', 'Japanese restaurant industry', 'Korean restaurant business', 'Non-alcoholic beverage store', 'Other bar business', 'Other foreign restaurant business', 'Other general retail stores', 'Other large general retail stores', 'Other sports facility operation business', 'Other unclassified entertainment-related service industries', 'Other water entertainment service industry', 'Pizza, hamburger, sandwich and similar restaurant business', 'Recreational condo operation business', 'Sports and recreational equipment rental business', 'Tourism Folk Crafts and Gifts Retail', 'Vehicle gas station operation business', 'Western-style restaurant business', 'bus transportation', 'car rental business', 'chain convenience store', 'duty free shop', 'hotel industry', 'inn business', 'massage business', 'meat retail', 'scheduled air transport', 'seafood retail', 'supermarket', 'taxi transportation industry', 'travel business']

Number of unique values in the 'gender' column: 2
['female', 'male']